
module.exports = (app) => {
  app.post("/text", async (req, res) => {
    var text = req.body.text
    // var text = `Гозум донув, вссим агыо барадыр
    // Гочакларым, мени сойоп деруцлері
    // Бов ата ярашар Ашыр бер саны,
    // Бизлере кайп окен Юсубык маны,
    // Нан учин Пигидин, себилдир жаны,
    // Ага-беглер, мени сойоп Йоруилері
    // Элкыссв, дидан сок Ашыр бер сердарыи бу сезувя
    // ошидкп Вигитлер думлы-душдав ат гогоп гелиц, атыны
    // жылавлап, Ашыр бег сердарвы собоп, алып видиберди-
    // лер. Нг IOcyn бег узакдан Ашыр бер сердары шу хи.
    // ли ягдайда баряныма гози душуп, белент аваз билен:
    // - эй, сиз, арслан дек Ашыр бегим, сизин ягдады, ныз ничик болды? - дийнп, хайкырып гойберди, дагла.
    // рын дерелери яиланып гитди, ахмалрак-ахмалрак рая.
    // лар ашаклыгына гуммурдешип гайтды.
    // ерде бир обят окады:
    // Ничик болды, мен билмедим халыны?
    // Мен айланай атыц билен озундені
    // Худайым сакласын сениц жаныны,
    // Мен айланай атык билен взундені
    // Голум баглы, бара балмен янына,
    // Эйэм рехим эйлесии гул дек жаныца,
    // Боа атык лале дек болмуш ганына,
    // Мен айлавай атыи билев езундені
    // Кэпирлере салып найза прасын,
    // Сайлап санчдын езитлерии сересия,
    // Маслыга долдурдын даглар арасын,
    // Мен айланай атык билев озупдені
    // Инди гары болды меним мазарым,
    // Хазан урды тер ачылан бахарым,
    // Севгули хемдемим, Ашыр сердарым,
    // Мен айланай атыц билен езундені
    // Бер Юсуп днер, пелек бозды шанымы,
    // Бисмил дейин ере докди ганымы,
    // Семии учин берей алса жанымы,
    // Мен айланай атын билев езупдені
    
    // Ики дунйаде рехберим,
    // Мерди мейданым, я, Алы
    // Рузе жезада дестгирим,
    // Эй, саябаным, я, Алы Истерем сизден хемаят,
    // Душди башыма кыямат,
    // Мушгулим эйлеп кипаят,
    // Серви рованым, я, Алы!
    // Галмады сабры карарым,
    // Ханы менин шахсуварым,
    // Болун инди медеткерим,
    // Шире Езданым, я, Алы!
    // Гарыпларын пенахы сиз,
    // Кулли эренлер шахы сиз,
    // Чилтенлерин патшахы снэ,
    // Рухы рованым, я, Алы!
    // Болупдыр шейле аламат,
    // Галманам мундан саламат,
    // Мырадым эйлен кипаят,
    // Шепагатгахим, я, Алы!
    // Дерменделер дестгири сен,
    // Сыпахыларын пири сен,
    // Кадыр Алланын шири сеп,
    // Чэбиксуварым, я, Алы!
    // Бу капирде ёкдур адет,
    // Ширим! - дийди сизи ахат.
    // Ашыр беге берин медет,
    // Пуште пенахым, я, Алы!
    // Элисса, андан сон, йигитлер урушарга мукайЙыт
    // болдулар. Хер хайсы бир ёлбарс дек болуп, чырпынып,
    // «Алла» дийип, гыгырып, ат гойдулар. Езитлери гоюн дек
    // болеклап, енлерине салы гырдылар. Езитлерин елуги
    // бугдайын пахалы ялы болуп галар эрди.
    // Хер ок атан-
    // ларында элли-алтыш езит ятар эрди. Алплар ол езит•
    // лери шейле ки чапар эрдилер, капирлер жезасыны @3-
    
    // Элкысса, дядам сон Ашыр Вег сердар кырк Йигиди
    // вялен дынмам уруш отдилер. Шол халда свитлер Юсув
    // вер билен Алмет беги бир белент дагын устуне зыка-? омо, ики голуны бир арча агажына мокем баглап, оли
    // К авпалталы, он мун саны бурны выллы, агаы гапакли
    // азнт орта алып, башына ярыш кими рамчы яодырым
    // уодулар. Сон ене абай-сыясат одио акры алип гилибер»
    // килер.
    // Шол ерде Юсуп бер ор-пирлерден медет, метираная
    // хидеп бир сез айдар болды
    // Ярадав жумле олеми,
    // Етишрин варыо ерлерде..
    // Тербиет оЙлеп халымы,
    // Втишгия карып ерлерде.
    // Хемише рухы дири сеп,
    // Кутбе заманын вири сен,
    // Дергожде хакын шири сен,
    // Втишгин гарып ерлерде.
    // Кепдур бу кокулде арман,
    // Билмен, кимден болар дерман,
    // Алы пирим Шахымердан,
    // Етишгия гарып ерлерде.
    // "Дагын башы болды гув-гув,
    // Хер гызылбат болды бир дев,
    // Хуммет, пирим Гарры Алов, Етишгин гарып ерлерде.
    // Юсуп бег Йыглар зар-у-зар,
    // Говяшы мисли новбахар,
    // Хорезминде Полван Пиряр, Етишгии гарып ерлерде.
    // Элкысса, андан сон Юсуп бег бу сезни айтды, хова-нын вузи булутлашып, ягыш ягмага башлады. Евитлер
    // алжырап, маслахатыны дитирио: маслыкларыны гате-
    // рип, акры гидибердилер.
    // Ашыр бег сердар оз Дигитлери билен езитлерни (9.
    // ларыны алып ковул уградылар. Вантлер
    // Пеше дигына
    
    // акынлашдылар. Юсуп бег Пеше дагыным пир, оплулом
    // ринден медет дилеп, даглара гаран, бир сод болды!
    // Овал бахар гелип гечдим,
    // Бизин даглар, Пеше даглар,
    // Бдитлере бейди болдум,
    // Долды гезум яша, даглар.
    // Сец-сен беглер сейнлгахи,
    // Одуц даглар патышахы,
    // Бузуркларыц гадамгахи,
    // Ел устунден аша, даглар.
    // Коне замандан галан сен,
    // Небилери сен гореп сен,
    // Армансыз довран сурен сен,
    // Шунча узак яша даглар.
    // Муса гудук долдуранда,
    // Тур дагына етиренде,
    // Элден гудук докуленде,
    // Сен гирер сем жоша, даглар.
    // Шири пеленлер "ермоге,
    // Елбарслар довран сурмаге,
    // Чилтенлер сехбет гурмага,
    // Хер бир кунжун кеше, даглар.
    // Иигитлер севеш кыланда,
    // Сайлар олуге доланда,
    // Езит устуме геленде,
    // Тутавергин даша, даглар.
    // Болупдыр шейле замана,
    // Даглар горуимез думана,
    // Дерелериц долды гапа,
    // Санжышып Йыкылша, даглар.
    // Пеше дагыным гашына,
    // Туруп гачар баш-башына,
    
    // Элкысса, андан сом Ашыр бег сердар Юсуп бегин бз сезлерини эшитгец, йигитлерине аЙтды:
    // - Инди, атык жылавундан тутуп, голтугымдан сойор
    // дуруці - дийди. Пигитлер атый
    // жылавундан тутуп,
    // голтугындан сейгет берип, гетерип дурдулар. Ашыр вер
    // сердар узакдан Юсуп беге - тагзым этди ве шу дуран еринден бир обят айдар болды:
    // Менин учин матам тутуп вглама,
    // Олсем ягшы, мен галынча, солтаным!
    // Нала кылып, йурегими даглама,
    // Сабыр эйлегей сен гелинча, солтаным!
    // Душди бизе айралыгын пырагы,
    // Талана денуддир омрум чырагы,
    // Жан жесетден чыкып лахет топрагы,
    // Гезлериме та долынча, солтаным!
    // Бойнума салып мен тыгы казаны,
    // Бержак арер Мухаммедин, азаны,
    // Нагехандан етнп ажал хазаны,
    // Эмрум гули те солынча, солтаным!
    // RETS TO
    // Ганлар аглар энен Ургенч юрдунда.
    // Ярын кеер айралыгын дердинде,
    // Бу мейданда, бу гун сенин алдында,
    // Олеем ягшы, мен галынча, солтаным!
    // Инди сенсиз Ватан адын тутманам,
    // Айралыгын захер абын ювутманам,
    // Сени гоюп мен хем мундан гитменем, Ашыр бег диер, то олинча, солтаным!
    // Элкысса, андан сон Йигитлер Ашыр бег сердара сой-
    // гет берип, гырага алы чыкдылар. Оны бердар-бердар
    // билен атдан душурдилер. Деркал Ашыр
    // яланачлап, ики кем отуз прасыны ганы
    // билен яглык
    // данып, моком багладылар. Ондан сон лыбасларыны эг-
    // нине гейдирип, совудыны устунден басып, гылыжыны
    // билине багла, галканыны кибтине ташлап, атына му-нуп, Йигитлере баш болуп, найзасына соенип, езитлере
    // рарал, хезрети Алыдан медет дилап, бир соз дийди:
    
    // Атыр бегии севешине,
    // Сен кылгын томаша, дагларх,
    // Овазы гитди пелеге,
    // Гул-гула етди мелеге,
    // Гарыпларни долды олуге,
    // Сен кылсан томаша, даглар.
    // Бул езитлер ёлум тусуп,
    // Дегре дашым лешгер басып,
    // Од халына йыглар Юсуп,
    // Медет бергил, Пеше даглар.
    // Элкысса, Ашыр бег сердар шол ерде атдан ере душ-
    // ман, бир сагат арам алман, отуз гиже-гундиз дынман уруш этдилер. Пеше датынын дерелери езитлерин мас-
    // лыгы билен долуп, багланды. Ган жош уруп, ат галда-лындан хер гапдала акар эрди. Даг-у-дашлар езитлерин
    // ганы билен гып-грмызы боянды. Шол халатда уруш
    // вагты Ашыр бег сердар копирлерии арасына душуп, ичи
    // кем отуз еринден яраны гетерип, тези донуп, эсси 1 н-дип, голундан найзасы ере душуп, атынын ялыны гу-
    // жаклап, оз халына гарап, йигитлерине: «Мени сейэо по.
    // рунлері» дийип, бир соз айдар болды:
    // Мигитлерим, гелин менин яныма,
    // Гочакларым, мени сойоп йорунлер!
    // Боз атым боялды гызыл ганыма,
    // Гочакларым, мени сойоп йоруилері
    // Хакдан гелмен экен мана махасыл,
    // Махасыл геленде гоймаз бир пасыл,
    // Мейданда болмады максадым хасыл,
    // Гочакларым, мени сойап йерунлері
    // Алысдан геруп мен сансыз гараны,
    // Деп эдебилмедим гелен беланы,
    // Гетердим ики кем отуз яраны,
    // Гочакларым, мени сойа йорунлері
    // Мен билмедим, бастым неден гарадыр?
    // Бисмил киби охли жисмим яр адыр,`
    var text = `Атыр бегии севешине,

    Сен кылгын томаша, дагларх,
    
    Овазы гитди пелеге,
    
    Гул-гула етди мелеге,
    
    Гарыпларни долды олуге,
    
    Сен кылсан томаша, даглар.
    
    Бул езитлер ёлум тусуп,
    
    Дегре дашым лешгер басып,
    
    Од халына йыглар Юсуп,
    
    Медет бергил, Пеше даглар.
    
    Элкысса, Ашыр бег сердар шол ерде атдан ере душ-
    
    ман, бир сагат арам алман, отуз гиже-гундиз дынман уруш этдилер. Пеше датынын дерелери езитлерин мас-
    
    лыгы билен долуп, багланды. Ган жош уруп, ат галда-лындан хер гапдала акар эрди. Даг-у-дашлар езитлерин
    
    ганы билен гып-грмызы боянды. Шол халатда уруш
    
    вагты Ашыр бег сердар копирлерии арасына душуп, ичи
    
    кем отуз еринден яраны гетерип, тези донуп, эсси 1 н-дип, голундан найзасы ере душуп, атынын ялыны гу-
    
    жаклап, оз халына гарап, йигитлерине: «Мени сейэо по.
    
    рунлері» дийип, бир соз айдар болды:
    
    Мигитлерим, гелин менин яныма,
    
    Гочакларым, мени сойоп йорунлер!
    
    Боз атым боялды гызыл ганыма,
    
    Гочакларым, мени сойоп йоруилері
    
    Хакдан гелмен экен мана махасыл,
    
    Махасыл геленде гоймаз бир пасыл,
    
    Мейданда болмады максадым хасыл,
    
    Гочакларым, мени сойап йерунлері
    
    Алысдан геруп мен сансыз гараны,
    
    Деп эдебилмедим гелен беланы,
    
    Гетердим ики кем отуз яраны,
    
    Гочакларым, мени сойа йорунлері
    
    Мен билмедим, бастым неден гарадыр?
    
    Бисмил киби охли жисмим яр адыр,`
    var new_text = ''
    for (let i = 0; i < text.length; i++) {
        const elem = text[i];
        // console.log(elem);
        switch(elem) {
            case 'А': new_text += 'A'; break;
            case 'а': new_text += 'a'; break;
            case 'Б': new_text += 'B'; break;
            case 'б': new_text += 'b'; break;
            case 'В': new_text += 'W'; break;
            case 'в': new_text += 'w'; break;
            case 'Г': new_text += 'G'; break;
            case 'г': new_text += 'g'; break;
            case 'Д': new_text += 'D'; break;
            case 'д': new_text += 'd'; break;
            case 'Е': new_text += 'E'; break;
            case 'е': new_text += 'e'; break;
            case 'Ё': new_text += 'Ýo'; break;
            case 'ё': new_text += 'ýo'; break;
            case 'Ж': new_text += 'J'; break;
            case 'ж': new_text += 'j'; break;
            case 'З': new_text += 'Z'; break;
            case 'з': new_text += 'z'; break;
            case 'И': new_text += 'I'; break;
            case 'и': new_text += 'i'; break;
            case 'Й': new_text += 'Ý'; break;
            case 'й': new_text += 'ý'; break;
            case 'К': new_text += 'K'; break;
            case 'к': new_text += 'k'; break;
            case 'Л': new_text += 'L'; break;
            case 'л': new_text += 'l'; break;
            case 'М': new_text += 'M'; break;
            case 'м': new_text += 'm'; break;
            case 'Н': new_text += 'N'; break;
            case 'н': new_text += 'n'; break;
            case 'О': new_text += 'O'; break;
            case 'Ө': new_text += 'Ö'; break;
            case 'о': new_text += 'o'; break;
            case 'П': new_text += 'P'; break;
            case 'п': new_text += 'p'; break;
            case 'Р': new_text += 'R'; break;
            case 'р': new_text += 'r'; break;
            case 'С': new_text += 'S'; break;
            case 'с': new_text += 's'; break;
            case 'Т': new_text += 'T'; break;
            case 'т': new_text += 't'; break;
            case 'У': new_text += 'U'; break;
            case 'у': new_text += 'u'; break;
            case 'Ф': new_text += 'F'; break;
            case 'ф': new_text += 'f'; break;
            case 'Х': new_text += 'H'; break;
            case 'х': new_text += 'h'; break;
            case 'Ц': new_text += 'S'; break;
            case 'ц': new_text += 's'; break;
            case 'Ч': new_text += 'Ç'; break;
            case 'ч': new_text += 'ç'; break;
            case 'Ш': new_text += 'Ş'; break;
            case 'ш': new_text += 'ş'; break;
            case 'Щ': new_text += 'Ş'; break;
            case 'щ': new_text += 'ş'; break;
            case 'ъ': new_text += ''; break;
            case 'Ы': new_text += 'Y'; break;
            case 'ы': new_text += 'y'; break;
            case 'Э': new_text += 'E'; break;
            case 'э': new_text += 'e'; break;
            case 'Ю': new_text += 'Ýu'; break;
            case 'ю': new_text += 'ýu'; break;
            case 'Я': new_text += 'Ýa'; break;
            case 'я': new_text += 'ýa'; break;
            
            case 'ә': new_text += 'ä'; break;
            case 'ү': new_text += 'ü'; break;
            case 'ө': new_text += 'ö'; break;
            

            case ' ': new_text += ' '; break;
            case ',': new_text += ','; break;
            case '.': new_text += '.'; break;
            case ';': new_text += ';'; break;
            case '-': new_text += '-'; break;
            case '?': new_text += '?'; break;
            case '!': new_text += '!'; break;
            case '*': new_text += '*'; break;
            case '%': new_text += '%'; break;
            case ':': new_text += ':'; break;
            case '/': new_text += '/'; break;
            case '(': new_text += '('; break;
            case ')': new_text += ')'; break;

            case '1': new_text += '1'; break;
            case '2': new_text += '2'; break;
            case '3': new_text += '3'; break;
            case '4': new_text += '4'; break;
            case '5': new_text += '5'; break;
            case '6': new_text += '6'; break;
            case '7': new_text += '7'; break;
            case '8': new_text += '8'; break;
            case '9': new_text += '9'; break;
            case '0': new_text += '0'; break;
        }
    }
    console.log(new_text)
    res.status(200).json({status:200, new_text})
  })

}
